{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int16", "sparse": false, "ragged": false, "name": "cat1"}, "name": "cat1", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int16", "sparse": false, "ragged": false, "name": "cat2"}, "name": "cat2", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int16", "sparse": false, "ragged": false, "name": "cat3"}, "name": "cat3", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int16", "sparse": false, "ragged": false, "name": "cat4"}, "name": "cat4", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int16", "sparse": false, "ragged": false, "name": "cat5"}, "name": "cat5", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int16", "sparse": false, "ragged": false, "name": "cat6"}, "name": "cat6", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int16", "sparse": false, "ragged": false, "name": "cat7"}, "name": "cat7", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int16", "sparse": false, "ragged": false, "name": "cat8"}, "name": "cat8", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "cont1"}, "name": "cont1", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "cont10"}, "name": "cont10", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "cont11"}, "name": "cont11", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "cont12"}, "name": "cont12", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "cont13"}, "name": "cont13", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "cont2"}, "name": "cont2", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "cont3"}, "name": "cont3", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "cont4"}, "name": "cont4", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "cont5"}, "name": "cont5", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "cont6"}, "name": "cont6", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "cont7"}, "name": "cont7", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "cont8"}, "name": "cont8", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "cont9"}, "name": "cont9", "inbound_nodes": []}, {"class_name": "DenseFeatures", "config": {"name": "dense_features", "trainable": true, "dtype": "float32", "feature_columns": [{"class_name": "EmbeddingColumn", "config": {"categorical_column": {"class_name": "VocabularyListCategoricalColumn", "config": {"key": "cat1", "vocabulary_list": [119, 273, 154, 245, 167, 249, 266, 184, 120, 158, 267, 73, 72, 155, 208, 276, 279, 137, 201, 166, 0, 102, 174, 272, 195, 197, 64, 256, 2, 3, 196, 198, 176, 177, 71, 269, 94, 226, 192, 227, 228, 34, 128, 106, 95, 202, 58, 74, 207, 251, 13, 194, 56, 5, 203, 206, 36, 114, 193, 178, 46, 84, 70, 126, 170, 96, 105, 141, 171, 134, 217, 257, 242, 117, 139, 175, 121, 99, 159, 89, 113, 240, 199, 123, 229, 98, 125, 31, 278, 45, 186, 150, 76, 67, 173, 187, 274, 247, 185, 225, 243, 250, 17, 179, 97, 214, 22, 115, 190, 144, 1, 69, 147, 210, 35, 172, 60, 50, 200, 37, 88, 41, 75, 237, 180, 25, 152, 157, 239, 216, 253, 110, 85, 42, 81, 258, 270, 254, 131, 181, 230, 271, 127, 53, 55, 234, 59, 268, 63, 93, 19, 205, 23, 132, 143, 261, 48, 156, 26, 248, 9, 90, 68, 151, 100, 124, 57, 12, 213, 218, 212, 223, 66, 233, 260, 262, 148, 246, 265, 169, 18, 8, 224, 86, 188, 91, 138, 211, 221, 47, 62, 149, 219, 107, 83, 65, 6, 7, 61, 277, 43, 140, 252, 118, 20, 28, 280, 220, 92, 109, 215, 189, 191, 168, 241, 244, 40, 108, 122, 160, 4, 136, 231, 78, 236, 38, 29, 79, 32, 77, 142, 222, 54, 275, 182, 235, 87, 183, 263, 165, 33, 30, 44, 264, 135, 259, 161, 145, 39, 14, 204, 10, 255, 103, 104, 163, 11, 162, 238, 146, 111, 164, 15, 209, 16, 101, 112, 130, 153, 129, 116, 49, 51, 24, 80, 52, 133, 21, 82, 232, 27], "dtype": "int64", "default_value": -1, "num_oov_buckets": 0}}, "dimension": 6, "combiner": "mean", "initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.4082482904638631, "seed": null, "dtype": "float32"}}, "ckpt_to_load_from": null, "tensor_name_in_ckpt": null, "max_norm": null, "trainable": true, "use_safe_embedding_lookup": true}}, {"class_name": "EmbeddingColumn", "config": {"categorical_column": {"class_name": "VocabularyListCategoricalColumn", "config": {"key": "cat2", "vocabulary_list": [6, 9, 4, 8, 2, 10, 11, 1, 7, 5, 0, 3], "dtype": "int64", "default_value": -1, "num_oov_buckets": 0}}, "dimension": 2, "combiner": "mean", "initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.7071067811865475, "seed": null, "dtype": "float32"}}, "ckpt_to_load_from": null, "tensor_name_in_ckpt": null, "max_norm": null, "trainable": true, "use_safe_embedding_lookup": true}}, {"class_name": "EmbeddingColumn", "config": {"categorical_column": {"class_name": "VocabularyListCategoricalColumn", "config": {"key": "cat3", "vocabulary_list": [0, 1, 2], "dtype": "int64", "default_value": -1, "num_oov_buckets": 0}}, "dimension": 1, "combiner": "mean", "initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 1.0, "seed": null, "dtype": "float32"}}, "ckpt_to_load_from": null, "tensor_name_in_ckpt": null, "max_norm": null, "trainable": true, "use_safe_embedding_lookup": true}}, {"class_name": "EmbeddingColumn", "config": {"categorical_column": {"class_name": "VocabularyListCategoricalColumn", "config": {"key": "cat4", "vocabulary_list": [0, 2, 1], "dtype": "int64", "default_value": -1, "num_oov_buckets": 0}}, "dimension": 1, "combiner": "mean", "initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 1.0, "seed": null, "dtype": "float32"}}, "ckpt_to_load_from": null, "tensor_name_in_ckpt": null, "max_norm": null, "trainable": true, "use_safe_embedding_lookup": true}}, {"class_name": "EmbeddingColumn", "config": {"categorical_column": {"class_name": "VocabularyListCategoricalColumn", "config": {"key": "cat5", "vocabulary_list": [2, 1, 0], "dtype": "int64", "default_value": -1, "num_oov_buckets": 0}}, "dimension": 1, "combiner": "mean", "initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 1.0, "seed": null, "dtype": "float32"}}, "ckpt_to_load_from": null, "tensor_name_in_ckpt": null, "max_norm": null, "trainable": true, "use_safe_embedding_lookup": true}}, {"class_name": "EmbeddingColumn", "config": {"categorical_column": {"class_name": "VocabularyListCategoricalColumn", "config": {"key": "cat6", "vocabulary_list": [0, 1], "dtype": "int64", "default_value": -1, "num_oov_buckets": 0}}, "dimension": 1, "combiner": "mean", "initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 1.0, "seed": null, "dtype": "float32"}}, "ckpt_to_load_from": null, "tensor_name_in_ckpt": null, "max_norm": null, "trainable": true, "use_safe_embedding_lookup": true}}, {"class_name": "EmbeddingColumn", "config": {"categorical_column": {"class_name": "VocabularyListCategoricalColumn", "config": {"key": "cat7", "vocabulary_list": [1, 0], "dtype": "int64", "default_value": -1, "num_oov_buckets": 0}}, "dimension": 1, "combiner": "mean", "initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 1.0, "seed": null, "dtype": "float32"}}, "ckpt_to_load_from": null, "tensor_name_in_ckpt": null, "max_norm": null, "trainable": true, "use_safe_embedding_lookup": true}}, {"class_name": "EmbeddingColumn", "config": {"categorical_column": {"class_name": "VocabularyListCategoricalColumn", "config": {"key": "cat8", "vocabulary_list": [6, 2, 5, 9, 3, 0, 4, 1, 8, 7], "dtype": "int64", "default_value": -1, "num_oov_buckets": 0}}, "dimension": 2, "combiner": "mean", "initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.7071067811865475, "seed": null, "dtype": "float32"}}, "ckpt_to_load_from": null, "tensor_name_in_ckpt": null, "max_norm": null, "trainable": true, "use_safe_embedding_lookup": true}}, {"class_name": "NumericColumn", "config": {"key": "cont1", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "cont10", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "cont11", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "cont12", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "cont13", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "cont2", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "cont3", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "cont4", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "cont5", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "cont6", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "cont7", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "cont8", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "cont9", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}], "partitioner": null}, "name": "dense_features", "inbound_nodes": [{"cat1": ["cat1", 0, 0, {}], "cat2": ["cat2", 0, 0, {}], "cat3": ["cat3", 0, 0, {}], "cat4": ["cat4", 0, 0, {}], "cat5": ["cat5", 0, 0, {}], "cat6": ["cat6", 0, 0, {}], "cat7": ["cat7", 0, 0, {}], "cat8": ["cat8", 0, 0, {}], "cont1": ["cont1", 0, 0, {}], "cont2": ["cont2", 0, 0, {}], "cont3": ["cont3", 0, 0, {}], "cont4": ["cont4", 0, 0, {}], "cont5": ["cont5", 0, 0, {}], "cont6": ["cont6", 0, 0, {}], "cont7": ["cont7", 0, 0, {}], "cont8": ["cont8", 0, 0, {}], "cont9": ["cont9", 0, 0, {}], "cont10": ["cont10", 0, 0, {}], "cont11": ["cont11", 0, 0, {}], "cont12": ["cont12", 0, 0, {}], "cont13": ["cont13", 0, 0, {}]}]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dense_features", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "exposure"}, "name": "exposure", "inbound_nodes": []}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_2", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "DenseFeatures", "config": {"name": "dense_features_1", "trainable": true, "dtype": "float32", "feature_columns": [{"class_name": "NumericColumn", "config": {"key": "exposure", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}], "partitioner": null}, "name": "dense_features_1", "inbound_nodes": [{"exposure": ["exposure", 0, 0, {}]}]}, {"class_name": "Dense", "config": {"name": "frequency_network", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Constant", "config": {"value": -3.4696109273019307}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "frequency_network", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABTAAAAcwoAAAB0AKABfAChAVMAKQFOKQLaAUvaA2xvZykB2gF4qQBy\nBAAAAPofPGlweXRob24taW5wdXQtMTctNDUxNDIxNzkzODM0PtoMbG9nX2Z1bmN0aW9uQgAAAHMC\nAAAAAAE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda", "inbound_nodes": [[["dense_features_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "name": "add", "inbound_nodes": [[["frequency_network", 0, 0, {}], ["lambda", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "frequency_out", "trainable": false, "dtype": "float32", "units": 1, "activation": "exp", "use_bias": true, "kernel_initializer": {"class_name": "Constant", "config": {"value": 1}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "frequency_out", "inbound_nodes": [[["add", 0, 0, {}]]]}], "input_layers": [["cat1", 0, 0], ["cat2", 0, 0], ["cat3", 0, 0], ["cat4", 0, 0], ["cat5", 0, 0], ["cat6", 0, 0], ["cat7", 0, 0], ["cat8", 0, 0], ["cont1", 0, 0], ["cont2", 0, 0], ["cont3", 0, 0], ["cont4", 0, 0], ["cont5", 0, 0], ["cont6", 0, 0], ["cont7", 0, 0], ["cont8", 0, 0], ["cont9", 0, 0], ["cont10", 0, 0], ["cont11", 0, 0], ["cont12", 0, 0], ["cont13", 0, 0], ["exposure", 0, 0]], "output_layers": [["frequency_out", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}